In [1]:
import numpy as np
import pandas as pd

In [2]:
import os

In [3]:
os.chdir("C:\\Users\\HP\\edureka\\edureka D drive\\Module 3 Deep Dive - Functions, OOPs, Modules, Errors and Exceptions\\Datasets")

In [4]:
pwd

'C:\\Users\\HP\\edureka\\edureka D drive\\Module 3 Deep Dive - Functions, OOPs, Modules, Errors and Exceptions\\Datasets'

In [5]:
ls

 Volume in drive C has no label.
 Volume Serial Number is 7C9F-24BB

 Directory of C:\Users\HP\edureka\edureka D drive\Module 3 Deep Dive - Functions, OOPs, Modules, Errors and Exceptions\Datasets

02-03-2021  15:10    <DIR>          .
02-03-2021  15:10    <DIR>          ..
12-02-2020  15:32    <DIR>          .ipynb_checkpoints
03-04-2018  16:20            11,769 bank-data.csv
03-04-2018  16:20            15,424 FairDealCustomerData.csv
               2 File(s)         27,193 bytes
               3 Dir(s)  234,319,659,008 bytes free

In [6]:
df = pd.read_csv("FairDealCustomerData.csv", header=None)

In [7]:
df.head()

            0                    1  2
0      Braund     Mr. Owen Harris   1
1   Heikkinen         Miss. Laina   0
2       Allen   Mr. William Henry   0
3       Moran           Mr. James   0
4    McCarthy       Mr. Timothy J   0

In [8]:
import re

In [9]:
df.columns = ['Lastname', 'Firstname', 'Blacklisted']

In [10]:
new = df['Firstname'].str.split(" ", n=-1, expand=True)

In [11]:
new

    0       1          2       3     4     5     6
0         Mr.       Owen  Harris        None  None
1       Miss.      Laina          None  None  None
2         Mr.    William   Henry        None  None
3         Mr.      James          None  None  None
4         Mr.    Timothy       J        None  None
..  ..    ...        ...     ...   ...   ...   ...
527       Mr.  Frederick   James        None  None
528       Mr.      Henry      Jr        None  None
529      Rev.     Juozas          None  None  None
530       Mr.       Karl  Howell        None  None
531       Mr.    Patrick          None  None  None

[532 rows x 7 columns]

In [12]:
df['Title'] = new[1]

In [13]:
df['Firstname'] = new[2]

In [14]:
df['Middlename'] = new[3]

In [15]:
df.head()

     Lastname Firstname  Blacklisted  Title Middlename
0      Braund      Owen            1    Mr.     Harris
1   Heikkinen     Laina            0  Miss.
2       Allen   William            0    Mr.      Henry
3       Moran     James            0    Mr.
4    McCarthy   Timothy            0    Mr.          J

In [16]:
new_col_order = ['Title','Firstname','Middlename','Lastname','Blacklisted']

In [17]:
df = df.reindex(columns = new_col_order)

In [18]:
df.head()

   Title Firstname Middlename    Lastname  Blacklisted
0    Mr.      Owen     Harris      Braund            1
1  Miss.     Laina              Heikkinen            0
2    Mr.   William      Henry       Allen            0
3    Mr.     James                  Moran            0
4    Mr.   Timothy          J    McCarthy            0

Leaving the problem unanswered. How to separate Titles using Regular expressions. And how to find missing values in Middlenames

Store the data in Customer Class

In [19]:
class Customer:
    def __init__(self,Title,Firstname,Middlename,Lastname,Blacklisted):
        self.Title = Title
        self.Firstname = Firstname
        self.Middlename = Middlename
        self.Lastname = Lastname
        self.Blacklisted = Blacklisted
        if Blacklisted == 0:
            self.Blacklisted = 'Not Blacklisted'
        else:
            self.Blacklisted = 'Blacklisted'
    def display():
        print(self.Title," ",self.Firstname," ",self.Middlename," ",self.Lastname," ",has," ",self.Blacklisted)

Made a try but din't understand the question perfectly

Create Custom Exception â€“ CustomerNotAllowedException

Gave up as it going in a loop

In [ ]:
class Custom(Exception):
    pass

class CustomerNotAllowed(Custom):
    pass
    
while True:
    try:
        for i in range(len(df['Blacklisted'])):
            if df['Blacklisted'][i] == 1:
                print("Customer is Allowed")
                
            else:
                raise CustomerNotAllowed 
        break        
        
    except CustomerNotAllowed:
        print("Customer is Not Allowed")
    
print("Done")

In [ ]:
df['Blacklisted']

In [ ]:
for i in range(len(df['Blacklisted'])):
    if df['Blacklisted'][i] == 1
        print("Customer is Allowed")
    else:
        raise CustomerNotAllowed

In [ ]:
df['Blacklisted'][1]

In [ ]:
df.info()

5. Pass a customer to function "createOrder" and throw CustomerNotAllowedException in case of blacklisted value is 1

In [28]:
class createOrder:
    def __init__(self,name,Blacklisted):
        self.name = name
        self.Blacklisted = Blacklisted
    def display(self):
        if self.Blacklisted == 1:
            self.Blacklisted = "Customer Not Allowed"
        else:
            self.Blacklisted = 'Customer Allowed'
        print("Customer name: ",self.name," ",self.Blacklisted)

In [29]:
ob = createOrder("abc",1)

In [30]:
print(ob.display())

Customer name:  abc   Customer Not Allowed
None

In [31]:
class createOrder:
    def __init__(self,name,Blacklisted,productname,productcode):
        self.name = name
        self.Blacklisted = Blacklisted
        self.productname = productname
        self.productcode = productcode
    def display(self):
        if self.Blacklisted == 1:
            self.Blacklisted = "Customer Not Allowed"
        else:
            self.Blacklisted = 'Customer Allowed'
        print("Customer name: ",self.name," ",self.Blacklisted)